#### Terraform Format and Style 🖌`success`
#### hca - Terraform Initialization ⚙️`success`
#### hca - Terraform Validation 🤖Success! The configuration is valid.


#### hca - Terraform Plan 📖`success`

<details><summary>hca - Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.ebi_staging_notification_pubsub_topic.data.google_project.project: Refreshing state...
data.google_dns_managed_zone.dev_zone: Refreshing state...
module.cloudsql.random_id.cloudsql_random_id: Refreshing state... [id=xC_nAuvmM8k]
module.cloudsql.random_id.db_password["argo"]: Refreshing state... [id=rJIvaqIiGO7JRzjluWcq_Q]
module.hca_argo_runner_account.google_service_account.sa: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/hca-argo-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
data.google_storage_transfer_project_service_account.sts_account: Refreshing state...
module.enable_services.google_project_service.cloud_resource_manager: Refreshing state... [id=broad-dsp-monster-hca-dev/cloudresourcemanager.googleapis.com]
data.google_project.current_project: Refreshing state...
google_storage_bucket.test_bucket: Refreshing state... [id=broad-dsp-monster-hca-dev-test-storage]
module.hca_dataflow_account.google_service_account.sa: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/hca-dataflow-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_gke_runner_account.google_service_account.sa: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/hca-gke-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.master.data.google_project.project: Refreshing state...
module.hca_test_account.google_service_account.sa: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/hca-test-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_storage_bucket.logs: Refreshing state... [id=broad-dsp-monster-hca-dev-error-logs]
google_storage_bucket.temp_bucket: Refreshing state... [id=broad-dsp-monster-hca-dev-temp-storage]
google_storage_bucket.staging_storage: Refreshing state... [id=broad-dsp-monster-hca-dev-staging-storage]
module.enable_services.google_project_service.service_usage: Refreshing state... [id=broad-dsp-monster-hca-dev/serviceusage.googleapis.com]
google_storage_bucket.hca_argo_archive: Refreshing state... [id=broad-dsp-monster-hca-dev-argo-archive]
module.ebi_writer_account.google_service_account.sa: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/ebi-staging-writer@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_storage_bucket.ebi_staging_bucket: Refreshing state... [id=broad-dsp-monster-hca-dev-ebi-staging]
module.hca_argo_runner_account.null_resource.sa_delay: Refreshing state... [id=3177923860552428035]
module.hca_argo_runner_account.google_service_account_key.sa_key: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/hca-argo-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com/keys/9c5a663985dffb57959433ab05a3db0df190f204]
module.hca_dataflow_account.null_resource.sa_delay: Refreshing state... [id=7118201721842306920]
module.hca_dataflow_account.google_service_account_key.sa_key: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/hca-dataflow-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com/keys/aa08ddd831b5996403cc321f38d76be1ca75152b]
google_logging_project_sink.bucket-log-sink: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/sinks/broad-dsp-monster-hca-dev-gcs-log-sink]
module.cloudsql.vault_generic_secret.postgres_user["argo"]: Refreshing state... [id=secret/dsde/monster/dev/ingest/hca/cloudsql/users/argo]
google_storage_bucket_iam_member.staging_account_iam_reader: Refreshing state... [id=b/broad-dsp-monster-hca-dev-staging-storage/roles/storage.objectViewer/serviceaccount:jade-k8-sa@broad-jade-dev.iam.gserviceaccount.com]
module.hca_test_account.null_resource.sa_delay: Refreshing state... [id=9134575832749528464]
google_storage_bucket_iam_member.hca_argo_temp_bucket_iam: Refreshing state... [id=b/broad-dsp-monster-hca-dev-temp-storage/roles/storage.admin/serviceaccount:hca-argo-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_test_account.google_service_account_key.sa_key: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/hca-test-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com/keys/1d445d25a746dab0d0fa32a66b843a984d120d2d]
google_storage_bucket_iam_member.hca_argo_staging_bucket_iam: Refreshing state... [id=b/broad-dsp-monster-hca-dev-staging-storage/roles/storage.admin/serviceaccount:hca-argo-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_gke_runner_account.null_resource.sa_delay: Refreshing state... [id=6954302391853138953]
module.hca_gke_runner_account.google_service_account_key.sa_key: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/hca-gke-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com/keys/5c35babda61168faf63fad119c72ada487352651]
google_service_account_iam_binding.dataflow_runner_user_binding: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/hca-dataflow-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com/roles/iam.serviceAccountUser]
module.hca_argo_runner_account.google_project_iam_member.sa_iam["bigquery.jobUser"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/bigquery.jobUser/serviceaccount:hca-argo-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_argo_runner_account.google_project_iam_member.sa_iam["compute.viewer"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/compute.viewer/serviceaccount:hca-argo-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_argo_runner_account.google_project_iam_member.sa_iam["dataflow.developer"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/dataflow.developer/serviceaccount:hca-argo-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_argo_runner_account.google_project_iam_member.sa_iam["bigquery.dataOwner"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/bigquery.dataOwner/serviceaccount:hca-argo-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_dataflow_account.google_project_iam_member.sa_iam["dataflow.worker"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/dataflow.worker/serviceaccount:hca-dataflow-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_service_account_iam_binding.hca_workload_identity_binding: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/hca-argo-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
google_storage_bucket_iam_member.hca_argo_logs_bucket_iam: Refreshing state... [id=b/broad-dsp-monster-hca-dev-argo-archive/roles/storage.admin/serviceaccount:hca-argo-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.sts_iam["storage.objectViewer"]: Refreshing state... [id=b/broad-dsp-monster-hca-dev-ebi-staging/roles/storage.objectViewer/serviceaccount:project-104615930137@storage-transfer-service.iam.gserviceaccount.com]
google_storage_bucket_iam_member.sts_iam["storage.legacyBucketReader"]: Refreshing state... [id=b/broad-dsp-monster-hca-dev-ebi-staging/roles/storage.legacyBucketReader/serviceaccount:project-104615930137@storage-transfer-service.iam.gserviceaccount.com]
google_storage_bucket_iam_member.sts_iam["storage.legacyBucketWriter"]: Refreshing state... [id=b/broad-dsp-monster-hca-dev-ebi-staging/roles/storage.legacyBucketWriter/serviceaccount:project-104615930137@storage-transfer-service.iam.gserviceaccount.com]
google_storage_bucket_iam_member.tdr_reader_iam["terra-data-repository@broad-datarepo-terra-prod.iam.gserviceaccount.com"]: Refreshing state... [id=b/broad-dsp-monster-hca-dev-ebi-staging/roles/storage.objectViewer/serviceaccount:terra-data-repository@broad-datarepo-terra-prod.iam.gserviceaccount.com]
google_storage_bucket_iam_member.tdr_reader_iam["hca-dataflow-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com"]: Refreshing state... [id=b/broad-dsp-monster-hca-dev-ebi-staging/roles/storage.objectViewer/serviceaccount:hca-dataflow-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.tdr_reader_iam["jade-k8-sa@broad-jade-dev.iam.gserviceaccount.com"]: Refreshing state... [id=b/broad-dsp-monster-hca-dev-ebi-staging/roles/storage.objectViewer/serviceaccount:jade-k8-sa@broad-jade-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.ebi_user_bucket_iam["enrique@ebi.ac.uk"]: Refreshing state... [id=b/broad-dsp-monster-hca-dev-ebi-staging/roles/storage.admin/user:enrique@ebi.ac.uk]
google_storage_bucket_iam_member.ebi_user_bucket_iam["rolando@ebi.ac.uk"]: Refreshing state... [id=b/broad-dsp-monster-hca-dev-ebi-staging/roles/storage.admin/user:rolando@ebi.ac.uk]
module.hca_argo_runner_account.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/dev/ingest/hca/service-accounts/hca-argo-runner]
module.hca_test_account.google_project_iam_member.sa_iam["dataflow.worker"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/dataflow.worker/serviceaccount:hca-test-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_test_account.google_project_iam_member.sa_iam["dataflow.admin"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/dataflow.admin/serviceaccount:hca-test-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_dataflow_account.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/dev/ingest/hca/service-accounts/hca-dataflow-runner]
module.ebi_writer_account.google_service_account_key.sa_key: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/ebi-staging-writer@broad-dsp-monster-hca-dev.iam.gserviceaccount.com/keys/0528cc1efbaa8f9eb2f4ca1c9172b9001fc919b8]
module.hca_gke_runner_account.google_project_iam_member.sa_iam["monitoring.metricWriter"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/monitoring.metricWriter/serviceaccount:hca-gke-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_gke_runner_account.google_project_iam_member.sa_iam["monitoring.viewer"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/monitoring.viewer/serviceaccount:hca-gke-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.ebi_writer_account.null_resource.sa_delay: Refreshing state... [id=1217901908648473952]
module.hca_test_account.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/dev/ingest/hca/service-accounts/hca-test-runner]
module.hca_gke_runner_account.google_project_iam_member.sa_iam["logging.logWriter"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/logging.logWriter/serviceaccount:hca-gke-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.bucket-log-writer: Refreshing state... [id=b/broad-dsp-monster-hca-dev-error-logs/roles/storage.objectCreator/serviceaccount:p104615930137-443008@gcp-sa-logging.iam.gserviceaccount.com]
module.hca_gke_runner_account.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/dev/ingest/hca/service-accounts/gke-runner]
google_storage_bucket_iam_member.temp_bucket_runner_iam: Refreshing state... [id=b/broad-dsp-monster-hca-dev-temp-storage/roles/storage.admin/serviceaccount:hca-dataflow-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.staging_bucket_runner_iam: Refreshing state... [id=b/broad-dsp-monster-hca-dev-staging-storage/roles/storage.admin/serviceaccount:hca-dataflow-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.test_bucket_iam: Refreshing state... [id=b/broad-dsp-monster-hca-dev-test-storage/roles/storage.admin/serviceaccount:hca-test-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.temp_bucket_test_iam: Refreshing state... [id=b/broad-dsp-monster-hca-dev-temp-storage/roles/storage.admin/serviceaccount:hca-test-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.ebi_writer_account.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/dev/ingest/hca/service-accounts/ebi-storage-writer]
google_storage_bucket_iam_member.ebi_writer_iam: Refreshing state... [id=b/broad-dsp-monster-hca-dev-ebi-staging/roles/storage.objectAdmin/serviceaccount:ebi-staging-writer@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.ebi_writer_account.google_project_iam_member.sa_iam["storagetransfer.user"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/storagetransfer.user/serviceaccount:ebi-staging-writer@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.ebi_writer_account.google_project_iam_member.sa_iam["storagetransfer.viewer"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/storagetransfer.viewer/serviceaccount:ebi-staging-writer@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.enable_services.google_project_service.services[15]: Refreshing state... [id=broad-dsp-monster-hca-dev/storage-api.googleapis.com]
module.enable_services.google_project_service.services[14]: Refreshing state... [id=broad-dsp-monster-hca-dev/stackdriver.googleapis.com]
module.enable_services.google_project_service.services[8]: Refreshing state... [id=broad-dsp-monster-hca-dev/replicapool.googleapis.com]
module.enable_services.google_project_service.services[12]: Refreshing state... [id=broad-dsp-monster-hca-dev/sqladmin.googleapis.com]
module.enable_services.google_project_service.services[17]: Refreshing state... [id=broad-dsp-monster-hca-dev/dataflow.googleapis.com]
module.enable_services.google_project_service.services[16]: Refreshing state... [id=broad-dsp-monster-hca-dev/storage-component.googleapis.com]
module.enable_services.google_project_service.services[1]: Refreshing state... [id=broad-dsp-monster-hca-dev/container.googleapis.com]
module.enable_services.google_project_service.services[18]: Refreshing state... [id=broad-dsp-monster-hca-dev/storagetransfer.googleapis.com]
module.enable_services.google_project_service.services[7]: Refreshing state... [id=broad-dsp-monster-hca-dev/monitoring.googleapis.com]
module.enable_services.google_project_service.services[0]: Refreshing state... [id=broad-dsp-monster-hca-dev/compute.googleapis.com]
module.enable_services.google_project_service.services[6]: Refreshing state... [id=broad-dsp-monster-hca-dev/logging.googleapis.com]
module.enable_services.google_project_service.services[11]: Refreshing state... [id=broad-dsp-monster-hca-dev/runtimeconfig.googleapis.com]
module.enable_services.google_project_service.services[13]: Refreshing state... [id=broad-dsp-monster-hca-dev/sql-component.googleapis.com]
module.enable_services.google_project_service.services[3]: Refreshing state... [id=broad-dsp-monster-hca-dev/dns.googleapis.com]
module.enable_services.google_project_service.services[2]: Refreshing state... [id=broad-dsp-monster-hca-dev/containerregistry.googleapis.com]
module.enable_services.google_project_service.services[10]: Refreshing state... [id=broad-dsp-monster-hca-dev/resourceviews.googleapis.com]
module.enable_services.google_project_service.services[4]: Refreshing state... [id=broad-dsp-monster-hca-dev/iam.googleapis.com]
module.enable_services.google_project_service.services[5]: Refreshing state... [id=broad-dsp-monster-hca-dev/iamcredentials.googleapis.com]
module.enable_services.google_project_service.services[9]: Refreshing state... [id=broad-dsp-monster-hca-dev/replicapoolupdater.googleapis.com]
module.dns_names.google_compute_global_address.global_ip_address["hca-argo"]: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/global/addresses/hca-argo-ip]
module.k8s_network.google_compute_network.network: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/global/networks/hca-network]
module.k8s_network.google_compute_address.nat_addresses[0]: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/regions/us-central1/addresses/hca-network-nat-0]
module.dns_names.google_compute_global_address.global_ip_address["hca-grafana"]: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/global/addresses/hca-grafana-ip]
module.cloudsql.module.proxy_sa.google_service_account.sa: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/command-center-proxy-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.k8s_network.google_compute_address.nat_addresses[1]: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/regions/us-central1/addresses/hca-network-nat-1]
module.cloudsql.google_sql_database_instance.postgres: Refreshing state... [id=command-center-postgres-c42fe702ebe633c9]
module.cloudsql.google_sql_user.db_user["argo"]: Refreshing state... [id=argo//command-center-postgres-c42fe702ebe633c9]
module.cloudsql.vault_generic_secret.postgres_connection_name: Refreshing state... [id=secret/dsde/monster/dev/ingest/hca/cloudsql/instance]
module.cloudsql.module.proxy_sa.google_service_account_key.sa_key: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/command-center-proxy-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com/keys/74eeb507111986ec37c079db088f58f725e52c98]
module.cloudsql.module.proxy_sa.null_resource.sa_delay: Refreshing state... [id=5633320881387768952]
module.cloudsql.module.proxy_sa.google_project_iam_member.sa_iam["cloudsql.client"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/cloudsql.client/serviceaccount:command-center-proxy-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.cloudsql.module.proxy_sa.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/dev/ingest/hca/service-accounts/command-center-proxy-runner]
module.dns_names.google_dns_record_set.a_dns["hca-grafana"]: Refreshing state... [id=monster-dev/hca-grafana-global.monster-dev.broadinstitute.org./A]
module.dns_names.google_dns_record_set.a_dns["hca-argo"]: Refreshing state... [id=monster-dev/hca-argo-global.monster-dev.broadinstitute.org./A]
module.k8s_network.google_compute_router.router: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/regions/us-central1/routers/hca-network-router]
module.k8s_network.google_compute_subnetwork.subnetworks[0]: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/regions/us-central1/subnetworks/hca-network]
module.dns_names.google_dns_record_set.cname_dns["hca-argo"]: Refreshing state... [id=monster-dev/hca-argo.monster-dev.broadinstitute.org./CNAME]
module.dns_names.google_dns_record_set.cname_dns["hca-grafana"]: Refreshing state... [id=monster-dev/hca-grafana.monster-dev.broadinstitute.org./CNAME]
module.k8s_network.google_compute_router_nat.nat: Refreshing state... [id=broad-dsp-monster-hca-dev/us-central1/hca-network-router/hca-network-nat]
module.master.google_container_cluster.master: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/locations/us-central1-c/clusters/hca-cluster]
module.cloudsql.google_sql_database.db["argo"]: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/instances/command-center-postgres-c42fe702ebe633c9/databases/argo]
module.master.vault_generic_secret.master_secrets: Refreshing state... [id=secret/dsde/monster/dev/ingest/hca/gke]
module.node_pool.google_container_node_pool.pool: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/locations/us-central1-c/clusters/hca-cluster/nodePools/hca-node-pool]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cloudsql.google_sql_database_instance.postgres will be updated in-place
  ~ resource "google_sql_database_instance" "postgres" {
        connection_name               = "broad-dsp-monster-hca-dev:us-central1:command-center-postgres-c42fe702ebe633c9"
        database_version              = "POSTGRES_9_6"
      + deletion_protection           = true
        first_ip_address              = "34.66.189.157"
        id                            = "command-center-postgres-c42fe702ebe633c9"
        ip_address                    = [
            {
                ip_address     = "34.66.189.157"
                time_to_retire = ""
                type           = "PRIMARY"
            },
        ]
        name                          = "command-center-postgres-c42fe702ebe633c9"
        project                       = "broad-dsp-monster-hca-dev"
        public_ip_address             = "34.66.189.157"
        region                        = "us-central1"
        self_link                     = "https://sqladmin.googleapis.com/sql/v1beta4/projects/broad-dsp-monster-hca-dev/instances/command-center-postgres-c42fe702ebe633c9"
        server_ca_cert                = [
            {
                cert             = <<~EOT
                    -----BEGIN CERTIFICATE-----
                    MIIDfzCCAmegAwIBAgIBADANBgkqhkiG9w0BAQsFADB3MS0wKwYDVQQuEyQ1OTU2
                    MWMxMS04NzM3LTQ4ZjctYTMxNS05ZDg5NDY4M2FjMTkxIzAhBgNVBAMTGkdvb2ds
                    ZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUsIEluYzELMAkG
                    A1UEBhMCVVMwHhcNMjAwNjAyMjExNDE2WhcNMzAwNTMxMjExNTE2WjB3MS0wKwYD
                    VQQuEyQ1OTU2MWMxMS04NzM3LTQ4ZjctYTMxNS05ZDg5NDY4M2FjMTkxIzAhBgNV
                    BAMTGkdvb2dsZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUs
                    IEluYzELMAkGA1UEBhMCVVMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
                    AQCvX9J23AsOb4Xo8NYZYx2cnJtwgOOmNAMBm8jmvf8dneDadwmqNZBScGEEXT9R
                    JDaRqCZt7XTsKqXCgI/UmOUjAlr9qgp8d8lBebLNnHMxJY9UGUrEAHkBo+6xsvyj
                    2pH/xAu2jBawin0gnv0wVS8ShW7iZsmI284Bf0M3Mg82VGlMPgKXgaHYsgqlHrhz
                    KAge4Mm6/NrfiS+95G9BwnUASwPk/emRjZyQdNnmAUk52M+7N4zWDFhpGt4hIwlW
                    ywug3YKxR2PRw14mBNVX5aNX3r89lfPnx59qeJ3kwFPOAK4Ae3w1e391Up3zXnss
                    jNpZOi5BwI01+sJDH6txjJJ5AgMBAAGjFjAUMBIGA1UdEwEB/wQIMAYBAf8CAQAw
                    DQYJKoZIhvcNAQELBQADggEBAHZuKxIVG3vzOv2LqkRQZXlBJYWbOlEzsX+XF05D
                    jAqFcPGbXFZOBk/Kd3SDEocJ4zV1L8IibGlVxKWc4GOC2KNZmejZtMX2snjL4y2Z
                    EuAA3FzANHdYLeG5EFnYJkI05Blv03DRxJ5NjLMOMbV7znSmcB5DrVkbEK4X6dce
                    ZEk8DzGeZo6NcEnuxisCrLyUWechHHROSYwIcXaUsbbw73VkmnIas1pv/8CgE19Y
                    aX4vDPpuW96uFDDnSlwqN4BK4pO1j2XREhmDDxkMb6xU+zS7cA4aO3x2Q1fTj5KD
                    4uV7C8PtBKxF/5y8p1h9YJYPwx7yiyNinnthc8Byyr2akks=
                    -----END CERTIFICATE-----
                EOT
                common_name      = "C=US,O=Google\\, Inc,CN=Google Cloud SQL Server CA,dnQualifier=59561c11-8737-48f7-a315-9d894683ac19"
                create_time      = "2020-06-02T21:14:16.061Z"
                expiration_time  = "2030-05-31T21:15:16.061Z"
                sha1_fingerprint = "11c06ca17a8ca467d3e01dc75e98c34388acb6fb"
            },
        ]
        service_account_email_address = "p104615930137-d8qs2c@gcp-sa-cloud-sql.iam.gserviceaccount.com"

        settings {
            activation_policy           = "ALWAYS"
            authorized_gae_applications = []
            availability_type           = "ZONAL"
            crash_safe_replication      = false
            disk_autoresize             = true
            disk_size                   = 10
            disk_type                   = "PD_SSD"
            pricing_plan                = "PER_USE"
            replication_type            = "SYNCHRONOUS"
            tier                        = "db-custom-4-15360"
            user_labels                 = {
                "app"   = "hca"
                "role"  = "database"
                "state" = "active"
            }
            version                     = 34

            backup_configuration {
                binary_log_enabled             = false
                enabled                        = true
                point_in_time_recovery_enabled = false
                start_time                     = "06:00"
            }

            ip_configuration {
                ipv4_enabled = true
                require_ssl  = true

                authorized_networks {
                    name  = "Broad"
                    value = "69.173.64.0/18"
                }
            }

            location_preference {
                zone = "us-central1-a"
            }
        }
    }

  # module.ebi_staging_notification_pubsub_topic.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-104615930137@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "broad-dsp-monster-hca-dev"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.ebi_staging_notification_pubsub_topic.google_pubsub_subscription.pull_subscriptions[0] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "ebi"
      + path                       = (known after apply)
      + project                    = "broad-dsp-monster-hca-dev"
      + topic                      = "broad-dsp-monster-hca-dev.staging-transfer-notifications"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.ebi_staging_notification_pubsub_topic.google_pubsub_subscription_iam_member.pull_subscription_binding[0] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-104615930137@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "broad-dsp-monster-hca-dev"
      + role         = "roles/pubsub.subscriber"
      + subscription = "ebi"
    }

  # module.ebi_staging_notification_pubsub_topic.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "broad-dsp-monster-hca-dev.staging-transfer-notifications"
      + project = "broad-dsp-monster-hca-dev"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }
    }

  # module.ebi_staging_notification_pubsub_topic.google_pubsub_topic_iam_member.pull_topic_binding[0] will be created
  + resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-104615930137@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "broad-dsp-monster-hca-dev"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/broad-dsp-monster-hca-dev/topics/broad-dsp-monster-hca-dev.staging-transfer-notifications"
    }

  # module.enable_services.google_project_service.services[19] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "pubsub.googleapis.com"
    }

Plan: 6 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @aherbst-broad, Action: `pull_request`, Working Directory: `/home/runner/work/monster-deploy/monster-deploy/environments/hca/terraform`, Workflow: `Terraform Plan`*